Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
/**
 ******************************************************************************
 * @file    bl702_adc.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_adc.h"
#include "bl702_ef_ctrl.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  ADC
 *  @{
 */

/** @defgroup  ADC_Private_Macros
 *  @{
 */
#undef MSG
#define MSG(...)
#define AON_CLK_SET_DUMMY_WAIT \
  {                            \
    __NOP();                   \
    __NOP();                   \
    __NOP();                   \
    __NOP();                   \
    __NOP();                   \
    __NOP();                   \
    __NOP();                   \
    __NOP();                   \
  }
#define ADC_RESTART_DUMMY_WAIT BL702_Delay_US(100)

/*@} end of group ADC_Private_Macros */

/** @defgroup  ADC_Private_Types
 *  @{
 */

/*@} end of group ADC_Private_Types */

/** @defgroup  ADC_Private_Variables
 *  @{
 */
static intCallback_Type   *adcIntCbfArra[ADC_INT_ALL] = {NULL};
static ADC_Gain_Coeff_Type adcGainCoeffCal            = {
               .adcGainCoeffEnable = DISABLE,
               .adcgainCoeffVal    = 0,
               .coe                = 1,
};

/*@} end of group ADC_Private_Variables */

/** @defgroup  ADC_Global_Variables
 *  @{
 */

/*@} end of group ADC_Global_Variables */

/** @defgroup  ADC_Private_Fun_Declaration
 *  @{
 */

/*@} end of group ADC_Private_Fun_Declaration */

/** @defgroup  ADC_Private_Functions
 *  @{
 */

/*@} end of group ADC_Private_Functions */

/** @defgroup  ADC_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  Software reset the whole ADC
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Reset(void) {
  uint32_t regCmd;

  /* reset ADC */
  regCmd = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, BL_SET_REG_BIT(regCmd, AON_GPADC_SOFT_RST));
  AON_CLK_SET_DUMMY_WAIT;
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, BL_CLR_REG_BIT(regCmd, AON_GPADC_SOFT_RST));
}

/****************************************************************************/ /**
                                                                                * @brief  ADC glable enable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_GLOBAL_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC glable disable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_GLOBAL_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC normal mode init
                                                                                *
                                                                                * @param  cfg: ADC normal mode configuration
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Init(ADC_CFG_Type *cfg) {
  uint32_t regCfg1;
  uint32_t regCfg2;
  uint32_t regCalib;

  CHECK_PARAM(IS_ADC_V18_SEL_TYPE(cfg->v18Sel));
  CHECK_PARAM(IS_ADC_V11_SEL_TYPE(cfg->v11Sel));
  CHECK_PARAM(IS_ADC_CLK_TYPE(cfg->clkDiv));
  CHECK_PARAM(IS_ADC_PGA_GAIN_TYPE(cfg->gain1));
  CHECK_PARAM(IS_ADC_PGA_GAIN_TYPE(cfg->gain2));
  CHECK_PARAM(IS_ADC_CHOP_MOD_TYPE(cfg->chopMode));
  CHECK_PARAM(IS_ADC_BIAS_SEL_TYPE(cfg->biasSel));
  CHECK_PARAM(IS_ADC_PGA_VCM_TYPE(cfg->vcm));
  CHECK_PARAM(IS_ADC_VREF_TYPE(cfg->vref));
  CHECK_PARAM(IS_ADC_SIG_INPUT_TYPE(cfg->inputMode));
  CHECK_PARAM(IS_ADC_DATA_WIDTH_TYPE(cfg->resWidth));

  /* config 1 */
  regCfg1 = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG1);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_V18_SEL, cfg->v18Sel);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_V11_SEL, cfg->v11Sel);
  regCfg1 = BL_CLR_REG_BIT(regCfg1, AON_GPADC_DITHER_EN);
  regCfg1 = BL_CLR_REG_BIT(regCfg1, AON_GPADC_SCAN_EN);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_SCAN_LENGTH, 0);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_CLK_DIV_RATIO, cfg->clkDiv);
  regCfg1 = BL_CLR_REG_BIT(regCfg1, AON_GPADC_CLK_ANA_INV);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_CAL_OS_EN, cfg->offsetCalibEn);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_RES_SEL, cfg->resWidth);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG1, regCfg1);
  AON_CLK_SET_DUMMY_WAIT;

  /* config 2 */
  regCfg2 = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_DLY_SEL, 0x02);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_PGA1_GAIN, cfg->gain1);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_PGA2_GAIN, cfg->gain2);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_BIAS_SEL, cfg->biasSel);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_CHOP_MODE, cfg->chopMode);
  /* pga_vcmi_en is for mic */
  regCfg2 = BL_CLR_REG_BIT(regCfg2, AON_GPADC_PGA_VCMI_EN);

