Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
  if ((cfg->gain1 != ADC_PGA_GAIN_NONE) || (cfg->gain2 != ADC_PGA_GAIN_NONE)) {
    regCfg2 = BL_SET_REG_BIT(regCfg2, AON_GPADC_PGA_EN);
  } else {
    regCfg2 = BL_CLR_REG_BIT(regCfg2, AON_GPADC_PGA_EN);
  }

  /* pga_os_cal is for mic */
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_PGA_OS_CAL, 8);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_PGA_VCM, cfg->vcm);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_VREF_SEL, cfg->vref);
  regCfg2 = BL_SET_REG_BITS_VAL(regCfg2, AON_GPADC_DIFF_MODE, cfg->inputMode);

  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, regCfg2);

  /* calibration offset */
  regCalib = BL_RD_REG(AON_BASE, AON_GPADC_REG_DEFINE);
  regCalib = BL_SET_REG_BITS_VAL(regCalib, AON_GPADC_OS_CAL_DATA, cfg->offsetCalibVal);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_DEFINE, regCalib);

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(GPADC_DMA_IRQn, GPADC_DMA_IRQHandler);
#endif

  ADC_Gain_Trim();
}

/****************************************************************************/ /**
                                                                                * @brief  ADC normal mode channel config
                                                                                *
                                                                                * @param  posCh: ADC pos channel type
                                                                                * @param  negCh: ADC neg channel type
                                                                                * @param  contEn: ENABLE or DISABLE continuous mode
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Channel_Config(ADC_Chan_Type posCh, ADC_Chan_Type negCh, BL_Fun_Type contEn) {
  uint32_t regCmd;
  uint32_t regCfg1;

  CHECK_PARAM(IS_AON_ADC_CHAN_TYPE(posCh));
  CHECK_PARAM(IS_AON_ADC_CHAN_TYPE(negCh));

  /* set channel */
  regCmd = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  regCmd = BL_SET_REG_BITS_VAL(regCmd, AON_GPADC_POS_SEL, posCh);
  regCmd = BL_SET_REG_BITS_VAL(regCmd, AON_GPADC_NEG_SEL, negCh);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, regCmd);

  /* set continuous mode */
  regCfg1 = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG1);
  regCfg1 = BL_SET_REG_BITS_VAL(regCfg1, AON_GPADC_CONT_CONV_EN, contEn);
  regCfg1 = BL_CLR_REG_BIT(regCfg1, AON_GPADC_SCAN_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG1, regCfg1);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC scan mode channel config
                                                                                *
                                                                                * @param  posChList[]: ADC pos channel list type
                                                                                * @param  negChList[]: ADC neg channel list type
                                                                                * @param  scanLength: ADC scan length
                                                                                * @param  contEn: ENABLE or DISABLE continuous mode
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Scan_Channel_Config(const ADC_Chan_Type posChList[], const ADC_Chan_Type negChList[], uint8_t scanLength, BL_Fun_Type contEn) {
  uint32_t tmpVal, i;
  uint32_t dealLen;

  CHECK_PARAM((scanLength < 13));

  /* Deal with the first 6 */
  dealLen = 6;

  if (scanLength < dealLen) {
    dealLen = scanLength;
  }

  /* Set first 6 scan channels */
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_SCN_POS1);

  for (i = 0; i < dealLen; i++) {
    tmpVal = tmpVal & (~(0x1F << (i * 5)));
    tmpVal |= (posChList[i] << (i * 5));
  }

  BL_WR_REG(AON_BASE, AON_GPADC_REG_SCN_POS1, tmpVal);

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_SCN_NEG1);

  for (i = 0; i < dealLen; i++) {
    tmpVal = tmpVal & (~(0x1F << (i * 5)));
    tmpVal |= (negChList[i] << (i * 5));
  }

  BL_WR_REG(AON_BASE, AON_GPADC_REG_SCN_NEG1, tmpVal);

  /* Set the left channels */
  if (scanLength > dealLen) {
    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_SCN_POS2);

    for (i = 0; i < scanLength - dealLen; i++) {
      tmpVal = tmpVal & (~(0x1F << (i * 5)));
      tmpVal |= (posChList[i + dealLen] << (i * 5));
    }

    BL_WR_REG(AON_BASE, AON_GPADC_REG_SCN_POS2, tmpVal);

    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_SCN_NEG2);

    for (i = 0; i < scanLength - dealLen; i++) {
      tmpVal = tmpVal & (~(0x1F << (i * 5)));
      tmpVal |= (negChList[i + dealLen] << (i * 5));
    }

    BL_WR_REG(AON_BASE, AON_GPADC_REG_SCN_NEG2, tmpVal);
  }

  /* Scan mode */
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_SCAN_LENGTH, scanLength - 1);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_CONT_CONV_EN, contEn);
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_CLK_ANA_INV);
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_SCAN_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG1, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC normal mode convert start
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Start(void) {
  uint32_t regCmd;

  /* disable convert start */
  regCmd = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  regCmd = BL_CLR_REG_BIT(regCmd, AON_GPADC_CONV_START);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, regCmd);

  ADC_RESTART_DUMMY_WAIT;

  /* enable convert start */
  regCmd = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  regCmd = BL_SET_REG_BIT(regCmd, AON_GPADC_CONV_START);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, regCmd);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC normal mode convert stop
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Stop(void) {
  uint32_t regCmd;

  /* disable convert start */
  regCmd = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  regCmd = BL_CLR_REG_BIT(regCmd, AON_GPADC_CONV_START);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, regCmd);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC FIFO configuration
                                                                                *
                                                                                * @param  fifoCfg: ADC FIFO confifuration pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_FIFO_Cfg(ADC_FIFO_Cfg_Type *fifoCfg) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_GPIP_ADC_FIFO_THRESHOLD_TYPE(fifoCfg->fifoThreshold));

