Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
  /*
   *  DMA enable : ,When the fifo data is exceeded to fifoThreshold DMA request will occur
   *  DMA disable : fifoThreshold determine how many data will raise FIFO ready interrupt
   */

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPADC_FIFO_THL, fifoCfg->fifoThreshold);

  /* Enable DMA */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GPIP_GPADC_DMA_EN, fifoCfg->dmaEn);

  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

  /* clear fifo by SET GPIP_GPADC_FIFO_CLR bit*/
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_CLR);
  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC get DMA FIFO data count
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return data count in FIFO
                                                                                *
                                                                                *******************************************************************************/
uint8_t ADC_Get_FIFO_Count(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

  return BL_GET_REG_BITS_VAL(tmpVal, GPIP_GPADC_FIFO_DATA_COUNT);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC get DMA FIFO full status
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SET or RESET
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type ADC_FIFO_Is_Full(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

  if (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_FULL)) {
    return SET;
  } else {
    return RESET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  ADC get DMA FIFO empty status
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SET or RESET
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type ADC_FIFO_Is_Empty(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

  if (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_NE)) {
    return RESET;
  } else {
    return SET;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  ADC read DMA FIFO data
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return ADC result if return 0 that means this is error data,user should ignore this data.
                                                                                *
                                                                                *******************************************************************************/
uint32_t ADC_Read_FIFO(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_DMA_RDATA);

  return (tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC parse result
                                                                                *
                                                                                * @param  orgVal: Original A to D value
                                                                                * @param  len: Original AD vaule count
                                                                                * @param  result: Final Result array pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Parse_Result(uint32_t *orgVal, uint32_t len, ADC_Result_Type *result) {
  uint8_t             neg     = 0;
  uint32_t            tmpVal1 = 0, tmpVal2 = 0;
  ADC_Data_Width_Type dataType;
  ADC_SIG_INPUT_Type  sigType;
  float               ref = 2.0;
  uint32_t            i   = 0;

  float coe = 1.0;

  if (adcGainCoeffCal.adcGainCoeffEnable) {
    coe = adcGainCoeffCal.coe;
  }

  tmpVal1  = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG1);
  tmpVal2  = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  dataType = BL_GET_REG_BITS_VAL(tmpVal1, AON_GPADC_RES_SEL);
  sigType  = BL_GET_REG_BITS_VAL(tmpVal2, AON_GPADC_DIFF_MODE);

  if (BL_GET_REG_BITS_VAL(tmpVal2, AON_GPADC_VREF_SEL) == ADC_VREF_3P2V) {
    ref = 3.2;
  }

  if (sigType == ADC_INPUT_SINGLE_END) {
    for (i = 0; i < len; i++) {
      result[i].posChan = orgVal[i] >> 21;
      result[i].negChan = -1;

      if (dataType == ADC_DATA_WIDTH_12) {
        result[i].value = (unsigned int)(((orgVal[i] & 0xffff) >> 4) / coe);
        result[i].volt  = result[i].value / 4096.0 * ref;
      } else if ((dataType == ADC_DATA_WIDTH_14_WITH_16_AVERAGE) || (dataType == ADC_DATA_WIDTH_14_WITH_64_AVERAGE)) {
        result[i].value = (unsigned int)(((orgVal[i] & 0xffff) >> 2) / coe);
        result[i].volt  = result[i].value / 16384.0 * ref;
      } else if ((dataType == ADC_DATA_WIDTH_16_WITH_128_AVERAGE) || (dataType == ADC_DATA_WIDTH_16_WITH_256_AVERAGE)) {
        result[i].value = (unsigned int)((orgVal[i] & 0xffff) / coe);
        result[i].volt  = result[i].value / 65536.0 * ref;
      }
    }
  } else {
    for (i = 0; i < len; i++) {
      neg               = 0;
      result[i].posChan = orgVal[i] >> 21;
      result[i].negChan = (orgVal[i] >> 16) & 0x1F;

      if (orgVal[i] & 0x8000) {
        orgVal[i] = ~orgVal[i];
        orgVal[i] += 1;
        neg = 1;
      }

      if (dataType == ADC_DATA_WIDTH_12) {
        result[i].value = (unsigned int)(((orgVal[i] & 0xffff) >> 4) / coe);
        result[i].volt  = result[i].value / 2048.0 * ref;
      } else if ((dataType == ADC_DATA_WIDTH_14_WITH_16_AVERAGE) || (dataType == ADC_DATA_WIDTH_14_WITH_64_AVERAGE)) {
        result[i].value = (unsigned int)(((orgVal[i] & 0xffff) >> 2) / coe);
        result[i].volt  = result[i].value / 8192.0 * ref;
      } else if ((dataType == ADC_DATA_WIDTH_16_WITH_128_AVERAGE) || (dataType == ADC_DATA_WIDTH_16_WITH_256_AVERAGE)) {
        result[i].value = (unsigned int)((orgVal[i] & 0xffff) / coe);
        result[i].volt  = result[i].value / 32768.0 * ref;
      }

      if (neg) {
        result[i].volt = -result[i].volt;
      }
    }
  }
}

/****************************************************************************/ /**
                                                                                * @brief  ADC mask or unmask certain or all interrupt
                                                                                *
                                                                                * @param  intType: interrupt type
                                                                                * @param  intMask: mask or unmask
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
BL_Mask_Type ADC_IntGetMask(ADC_INT_Type intType) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_GPIP_ADC_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  switch (intType) {
  case ADC_INT_POS_SATURATION:
    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
    return BL_IS_REG_BIT_SET(tmpVal, AON_GPADC_POS_SATUR_MASK);
    break;

  case ADC_INT_NEG_SATURATION:
    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
    return BL_IS_REG_BIT_SET(tmpVal, AON_GPADC_NEG_SATUR_MASK);
    break;

