Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
  case ADC_INT_FIFO_UNDERRUN:
    tmpVal = BL_RD_REG(AON_BASE, GPIP_GPADC_CONFIG);
    return BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_MASK);
    break;

  case ADC_INT_FIFO_OVERRUN:
    tmpVal = BL_RD_REG(AON_BASE, GPIP_GPADC_CONFIG);
    return BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_OVERRUN_MASK);
    break;

  case ADC_INT_ADC_READY:
    tmpVal = BL_RD_REG(AON_BASE, GPIP_GPADC_CONFIG);
    return BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_RDY_MASK);
    break;

  case ADC_INT_FIFO_READY:
    tmpVal = BL_RD_REG(AON_BASE, GPIP_GPADC_CONFIG);
    return BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_RDY_MASK);
    break;
  default:
    break;
  }
  return 0;
}

/****************************************************************************/ /**
                                                                                * @brief  ADC mask or unmask certain or all interrupt
                                                                                *
                                                                                * @param  intType: interrupt type
                                                                                * @param  intMask: mask or unmask
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_IntMask(ADC_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_GPIP_ADC_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  switch (intType) {
  case ADC_INT_POS_SATURATION:
    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);

    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_MASK);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_MASK);
    }

    BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);
    break;

  case ADC_INT_NEG_SATURATION:
    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);

    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_MASK);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_MASK);
    }

    BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);
    break;

  case ADC_INT_FIFO_UNDERRUN:
    tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_MASK);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_MASK);
    }

    BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
    break;

  case ADC_INT_FIFO_OVERRUN:
    tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_MASK);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_MASK);
    }

    BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
    break;

  case ADC_INT_ADC_READY:
    tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_RDY_MASK);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_RDY_MASK);
    }

    BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
    break;

  case ADC_INT_FIFO_READY:
    tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);

    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_RDY_MASK);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_RDY_MASK);
    }

    BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
    break;

  case ADC_INT_ALL:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      tmpVal = BL_RD_REG(GPIP_BASE, AON_GPADC_REG_ISR);
      tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_MASK);
      BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

      tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_MASK);
      tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_RDY_MASK);
      BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
    } else {
      /* Disable this interrupt */
      tmpVal = BL_RD_REG(GPIP_BASE, AON_GPADC_REG_ISR);
      tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_MASK);
      BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

      tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_MASK);
      tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_RDY_MASK);
      BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
    }

    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  ADC clear certain or all interrupt
                                                                                *
                                                                                * @param  intType: interrupt type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_IntClr(ADC_INT_Type intType) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_GPIP_ADC_INT_TYPE(intType));

  switch (intType) {
  case ADC_INT_POS_SATURATION:
    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
    tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_CLR);
    BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

    tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_CLR);
    BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

