Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
  case ADC_INT_FIFO_OVERRUN:
    tmpVal    = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
    bitStatus = (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_OVERRUN)) ? SET : RESET;
    break;

  case ADC_INT_ADC_READY:
    tmpVal    = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
    bitStatus = (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_RDY)) ? SET : RESET;
    break;

  case ADC_INT_FIFO_READY:
    tmpVal    = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
    bitStatus = (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_RDY)) ? SET : RESET;
    break;

  case ADC_INT_ALL:
    break;

  default:
    break;
  }

  return bitStatus;
}

/****************************************************************************/ /**
                                                                                * @brief  ADC install interrupt callback
                                                                                *
                                                                                * @param  intType: ADC interrupt type
                                                                                * @param  cbFun: ADC interrupt callback
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Int_Callback_Install(ADC_INT_Type intType, intCallback_Type *cbFun) {
  /* Check the parameters */
  CHECK_PARAM(IS_GPIP_ADC_INT_TYPE(intType));

  adcIntCbfArra[intType] = cbFun;
}

/****************************************************************************/ /**
                                                                                * @brief  ADC DMA interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void GPADC_DMA_IRQHandler(void) {
  if (ADC_GetIntStatus(ADC_INT_POS_SATURATION) == SET) {
    ADC_IntClr(ADC_INT_POS_SATURATION);

    if (adcIntCbfArra[ADC_INT_POS_SATURATION] != NULL) {
      adcIntCbfArra[ADC_INT_POS_SATURATION]();
    }
  }

  if (ADC_GetIntStatus(ADC_INT_NEG_SATURATION) == SET) {
    ADC_IntClr(ADC_INT_NEG_SATURATION);

    if (adcIntCbfArra[ADC_INT_NEG_SATURATION] != NULL) {
      adcIntCbfArra[ADC_INT_NEG_SATURATION]();
    }
  }

  if (ADC_GetIntStatus(ADC_INT_FIFO_UNDERRUN) == SET) {
    ADC_IntClr(ADC_INT_FIFO_UNDERRUN);

    if (adcIntCbfArra[ADC_INT_FIFO_UNDERRUN] != NULL) {
      adcIntCbfArra[ADC_INT_FIFO_UNDERRUN]();
    }
  }

  if (ADC_GetIntStatus(ADC_INT_FIFO_OVERRUN) == SET) {
    ADC_IntClr(ADC_INT_FIFO_OVERRUN);

    if (adcIntCbfArra[ADC_INT_FIFO_OVERRUN] != NULL) {
      adcIntCbfArra[ADC_INT_FIFO_OVERRUN]();
    }
  }

  if (ADC_GetIntStatus(ADC_INT_FIFO_READY) == SET) {
    ADC_IntClr(ADC_INT_FIFO_READY);

    if (adcIntCbfArra[ADC_INT_FIFO_READY] != NULL) {
      adcIntCbfArra[ADC_INT_FIFO_READY]();
    }
  }

  if (ADC_GetIntStatus(ADC_INT_FIFO_READY) == SET) {
    ADC_IntClr(ADC_INT_FIFO_READY);

    if (adcIntCbfArra[ADC_INT_FIFO_READY] != NULL) {
      adcIntCbfArra[ADC_INT_FIFO_READY]();
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  ADC VBAT enable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Vbat_Enable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_VBAT_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC VBAT disable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Vbat_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_VBAT_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC TSEN Config
                                                                                *
                                                                                * @param  tsenMod: None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Tsen_Init(ADC_TSEN_MOD_Type tsenMod) {
  uint32_t tmpVal;

  CHECK_PARAM(IS_AON_ADC_TSEN_MOD_TYPE(type));

  /* config gpadc_reg_cmd */
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  /* enable sensor dc test mux*/
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_SEN_TEST_EN);
  /*selected sen output current channel*/
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_SEN_SEL, 0);
  /* enable chip sensor*/
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_CHIP_SEN_PU);
  /*dwa_en */
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_DWA_EN, 1);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal);

  /* config 2 */
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  /*tsvbe low=0*/
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_TSVBE_LOW);
  /*dly_sel=2*/
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_DLY_SEL, 2);
  /*test_sel=0*/
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_TEST_SEL, 0);
  /*test_en=0*/
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_TEST_EN);
  /*ts_en*/
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_TS_EN);
  /*select tsen ext or inner*/
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_TSEXT_SEL, tsenMod);

  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_PGA_VCM, 2);
  /*pga vcmi enable*/
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_PGA_VCMI_EN);
  /*0:512uS;1:16mS;2:32mS;3:64mS*/
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_PGA_OS_CAL, 0);

  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);

  /* config 3 */
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG1);
  /* set gpadc_dither_en */
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_DITHER_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG1, tmpVal);

  /* set 4000F90C[19](gpadc_mic2_diff) = 1
   * debug advise form Ran
   * 2020.08.26
   */
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_MIC2_DIFF, 1);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC TSEN Enable
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Tsen_Enable(void) {
  uint32_t tmpVal;

