Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_TS_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC TSEN Disable
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_Tsen_Disable(void) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_TS_EN);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  ADC Clear fifo
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_FIFO_Clear(void) {
  uint32_t tmpVal;

  /* clear fifo by SET GPIP_GPADC_FIFO_CLR bit*/
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_CLR);
  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  config pga
                                                                                *
                                                                                * @param  pga_vcmi_enable: enable or not vcmi
                                                                                * @param  pga_os_cal: pga os cal value
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_PGA_Config(uint8_t pga_vcmi_enable, uint8_t pga_os_cal) {
  uint32_t tmpVal;

  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);

  if (pga_vcmi_enable) {
    tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_PGA_VCMI_EN);
  } else {
    tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_PGA_VCMI_EN);
  }

  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, AON_GPADC_PGA_OS_CAL, pga_os_cal);

  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}
/****************************************************************************/ /**
                                                                                * @brief  TSEN_Get_V_Error
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
uint32_t TSEN_Get_V_Error(void) {
  uint32_t        v0 = 0, v1 = 0;
  uint32_t        v_error = 0;
  uint32_t        regVal  = 0;
  ADC_Result_Type result;
  uint32_t        tmpVal;
  uint8_t         gainCalEnabled = 0;

  /* clear fifo by SET GPIP_GPADC_FIFO_CLR bit*/
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_CLR);
  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

  ADC_SET_TSVBE_LOW();

  ADC_Start();

  while (ADC_Get_FIFO_Count() == 0)
    ;

  regVal                             = ADC_Read_FIFO();
  gainCalEnabled                     = adcGainCoeffCal.adcGainCoeffEnable;
  adcGainCoeffCal.adcGainCoeffEnable = 0;
  ADC_Parse_Result(&regVal, 1, &result);
  adcGainCoeffCal.adcGainCoeffEnable = gainCalEnabled;
  v0                                 = result.value;

  /* clear fifo by SET GPIP_GPADC_FIFO_CLR bit*/
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_CLR);
  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

  ADC_SET_TSVBE_HIGH();

  ADC_Start();

  while (ADC_Get_FIFO_Count() == 0)
    ;

  regVal                             = ADC_Read_FIFO();
  gainCalEnabled                     = adcGainCoeffCal.adcGainCoeffEnable;
  adcGainCoeffCal.adcGainCoeffEnable = 0;
  ADC_Parse_Result(&regVal, 1, &result);
  adcGainCoeffCal.adcGainCoeffEnable = gainCalEnabled;
  v1                                 = result.value;

  v_error = v0 - v1;

  return v_error;
}

/****************************************************************************/ /**
                                                                                * @brief  Trim TSEN
                                                                                *
                                                                                * @param  tsen_offset: None
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION ADC_Trim_TSEN(uint16_t *tsen_offset) {
  Efuse_TSEN_Refcode_Corner_Type trim;

  EF_Ctrl_Read_TSEN_Trim(&trim);
  if (trim.tsenRefcodeCornerEn) {
    if (trim.tsenRefcodeCornerParity == EF_Ctrl_Get_Trim_Parity(trim.tsenRefcodeCorner, 12)) {
      *tsen_offset = trim.tsenRefcodeCorner;

      return SUCCESS;
    }
  }

