Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_adc.c
  return ERROR;
}

/****************************************************************************/ /**
                                                                                * @brief  SET ADC TSEN TSVBE LOW/HIGH
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_SET_TSVBE_LOW(void) {
  uint32_t tmpVal;
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_TSVBE_LOW);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  SET ADC TSEN TSVBE LOW/HIGH
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void ADC_SET_TSVBE_HIGH(void) {
  uint32_t tmpVal;
  tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);
  tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_TSVBE_LOW);
  BL_WR_REG(AON_BASE, AON_GPADC_REG_CONFIG2, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  SET ADC TSEN TSVBE LOW/HIGH
                                                                                *
                                                                                * @param  tsen_offset: tsen_offset form efuse trim data
                                                                                *
                                                                                * @return tempture
                                                                                *
                                                                                *******************************************************************************/
float TSEN_Get_Temp(uint32_t tsen_offset) {
  uint32_t        v0 = 0, v1 = 0;
  float           temp   = 0;
  uint32_t        regVal = 0;
  ADC_Result_Type result;
  uint32_t        tmpVal;
  uint8_t         gainCalEnabled = 0;

  /* clear fifo by SET GPIP_GPADC_FIFO_CLR bit*/
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_CLR);
  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

  ADC_SET_TSVBE_LOW();

  ADC_Start();

  while (ADC_Get_FIFO_Count() == 0)
    ;

  regVal = ADC_Read_FIFO();

  gainCalEnabled                     = adcGainCoeffCal.adcGainCoeffEnable;
  adcGainCoeffCal.adcGainCoeffEnable = 0;
  ADC_Parse_Result(&regVal, 1, &result);
  adcGainCoeffCal.adcGainCoeffEnable = gainCalEnabled;
  v0                                 = result.value;

  /* clear fifo by SET GPIP_GPADC_FIFO_CLR bit*/
  tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_CLR);
  BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

  ADC_SET_TSVBE_HIGH();

  ADC_Start();

  while (ADC_Get_FIFO_Count() == 0)
    ;

  regVal                             = ADC_Read_FIFO();
  gainCalEnabled                     = adcGainCoeffCal.adcGainCoeffEnable;
  adcGainCoeffCal.adcGainCoeffEnable = 0;
  ADC_Parse_Result(&regVal, 1, &result);
  adcGainCoeffCal.adcGainCoeffEnable = gainCalEnabled;
  v1                                 = result.value;

  if (v0 > v1) {
    temp = (((float)v0 - (float)v1) - (float)tsen_offset) / 7.753;
  } else {
    temp = (((float)v1 - (float)v0) - (float)tsen_offset) / 7.753;
  }

  return temp;
}

/****************************************************************************/ /**
                                                                                * @brief  ADC MIC Config
                                                                                *
                                                                                * @param  adc_mic_config: adc_mic_config
                                                                                *
                                                                                * @return success or not
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type ADC_Mic_Init(ADC_MIC_Type *adc_mic_config) {
  uint32_t tmpVal1 = 0, tmpVal2 = 0;

  CHECK_PARAM(IS_ADC_MICBOOST_DB_Type(adc_mic_config->micboostDb));
  CHECK_PARAM(IS_PGA2_GAIN_Type(adc_mic_config->micPga2Gain));
  CHECK_PARAM(IS_ADC_MIC_MODE_Type(adc_mic_config->mic1Mode));
  CHECK_PARAM(IS_ADC_MIC_MODE_Type(adc_mic_config->mic2Mode));
  CHECK_PARAM(IS_BL_Fun_Type(adc_mic_config->dwaEn));
  CHECK_PARAM(IS_BL_Fun_Type(adc_mic_config->micboostBypassEn));
  CHECK_PARAM(IS_BL_Fun_Type(adc_mic_config->micPgaEn));
  CHECK_PARAM(IS_BL_Fun_Type(adc_mic_config->micBiasEn));

  tmpVal2 = BL_RD_REG(AON_BASE, AON_GPADC_REG_CONFIG2);

  tmpVal1 = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
  tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_MICBOOST_32DB_EN, adc_mic_config->micboostDb);
  tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_MIC_PGA2_GAIN, adc_mic_config->micPga2Gain);
  tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_MIC1_DIFF, adc_mic_config->mic1Mode);
  tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_MIC2_DIFF, adc_mic_config->mic2Mode);
  tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_DWA_EN, adc_mic_config->dwaEn);
  tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_BYP_MICBOOST, adc_mic_config->micboostBypassEn);

